Read online_bl.csv from data_input folder to answer question 1-3. You may find it helpful to use parse_dates=[__] while calling the read_csv() function. The data are all items listed for sale on the popular e-commerce website bukalapak.com within a specific set of categories.

#1. How many unique sub categories are there in online_bl dataset? Do we have more "detergent" listings or "sugar" listings within our data?

In [106]:
import pandas as pd
df_online = pd.read_csv("data_input/online_bl.csv", parse_dates=['time_update'])

In [107]:
df_online['sub_category'].nunique()

3

In [108]:
pd.crosstab(index=df_online['sub_category'], 
            columns='count', 
            values=df_online['sub_category'],
            aggfunc='count')

col_0         count
sub_category
detergent       106
rice            425
sugar           213

#2. In which scale do we have our detergent stock the most?

In [109]:
df_detergent = df_online[(df_online['sub_category']=='detergent')]
pd.crosstab(index=df_detergent['scale'], 
            columns='countotal', 
            values=df_detergent['scale'], 
            aggfunc='count').sort_values(by='countotal', ascending=False).head(1)

col_0   countotal
scale
1.8 kg         88

#3. Which month has the lowest average price (mean on price_original) for detergent products (1.8kg and 800gr respectively) listed for sale on Bukalapak? Are they the same month?

In [110]:
pd.crosstab(index=df_detergent['time_update'].dt.to_period('M'),
            columns=[df_detergent['sub_category'], df_online['scale']],
            values=df_detergent['price_original'],
            aggfunc='mean')

sub_category     detergent
scale               1.8 kg        800 gr
time_update
2018-07       40000.000000  30000.000000
2018-08       31000.000000  20000.000000
2018-09       42750.000000  33475.000000
2018-10       41191.836735  21945.454545

#4. Using techcrunch.csv, which category raised the most amount in funding (raisedAmt) on average (use the median)?

In [111]:
df_techcrunch = pd.read_csv('data_input/techcrunch.csv', index_col=0)

In [112]:
pd.crosstab(index=df_techcrunch['category'], 
            columns='average', 
            values=df_techcrunch['raisedAmt'], 
            aggfunc='median').sort_values(by='average', ascending=False).head(1)

col_0      average
category
biotech   20000000

#5. In which period does Friendster gain their highest raised amount of funding?

In [113]:
df_techcrunch[(df_techcrunch['company']=='Friendster')].sort_values(by='raisedAmt', ascending=False).head(1)

,company,numEmps,category,city,state,fundedDate,raisedAmt,raisedCurrency,round
permalink,,,,,,,,,
friendster,Friendster,465.0,web,San Francisco,CA,5-Aug-08,20000000,USD,d

#6. Among all companies in San Francisco, which of the following are not among the top 5 most funded ( has highest total raisedAmt) companies?

In [114]:
df_techcrunch = df_techcrunch[(df_techcrunch['city']=='San Francisco')]

pd.crosstab(index=df_techcrunch['company'], 
            columns='sumtotal', 
            values=df_techcrunch['raisedAmt'],
            aggfunc='sum').sort_values(by='sumtotal', ascending=False).head()

col_0       sumtotal
company
Slide       58000000
freebase    57500000
OpenTable   48000000
Friendster  45400000
Snapfish    43500000